# MetallicpaintPearlAmount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MetallicPaint..::..MetallicpaintPearlAmount Property
MetallicPaint Class See Also
---
The property labeled "Amount" from the "MetallicPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetallicpaintPearlAmount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetallicpaintPearlAmount As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetallicpaintPearlAmount {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".
# See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace